OpenDTEF-v2012/tutorials/verificationAndValidation/atmosphericModels/atmForestStability/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

# Without template file(s)
rm -f 0/qPlant.template

runApplication blockMesh

runApplication renumberMesh -overwrite

#------------------------------------------------------------------------------
