OpenDTEF-v2012/tutorials/verificationAndValidation/atmosphericModels/atmForestStability/system/turbulenceFields
// -*- C++ -*-

type            turbulenceFields;
libs            (fieldFunctionObjects);
field           R;
writeControl    writeTime;


// *********************************************************************** //
